Revit 2027 API
EmbodiedCarbonAsset Properties
The EmbodiedCarbonAsset type exposes the following members.
Properties
Name | Description
CarbonCoefficient |  Used by Insight, unit is kgCO₂e per length, area, etc., e.g 200.234 kgCO₂e/m
CarbonCoefficientUnitType |  The unit type of Embodied Carbon coefficient (e.g. kgCO₂e/m, kgCO₂e/kg,...)
CategoryId |  Internal identifier of category. List of available categories can be retrieved from Sustainability API.
CategoryName |  User visible name of category. List of available categories can be retrieved from Sustainability API.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the EmbodiedCarbon asset.
ProviderId |  Internal identifier of provider, which provide embodied carbon data. List of available providers can be retrieved from Sustainability API.
ProviderName |  User visible name of provider. List of available providers can be retrieved from Sustainability API.
Top
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace